Revit 2024 API
DimensionEqualityLabelFormatting.SetFormatOptions Method
 Sets the format options used to show the parameter value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public void SetFormatOptions(
	FormatOptions formatOptions
)
Visual Basic
Public Sub SetFormatOptions ( _
	formatOptions As FormatOptions _
)
Visual C++
public:
void SetFormatOptions(
	FormatOptions^ formatOptions
)
Parameters
formatOptions
Type: Autodesk.Revit.DB.FormatOptions
 The format options to be set.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  This DimensionEqualityLabelFormatting uses a LabelType which does not support assignment of FormatOptions.
See Also
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace